<?php

    //  проверка инициализации
        if (empty($GLOBALS['@']['ENGINE'])) exit;

    //  локализация
        $GLOBALS['@']['LANG']['DATA'] = [
            //  'элемент' => [
            //      'фраза' => ['английский', 'казахский', 'русский']
            //  ]
            'g-interfase' => [ // интерфейс
                '001' => ['Add', 'Қосу', 'Добавить'],
                '002' => ['Save', 'Сақтау', 'Сохранить'],
                '003' => ['Change', 'Өзгерту', 'Изменить'],
                '004' => ['Delete', 'Жою', 'Удалить'],
                '005' => ['Cancel', 'Болдырмау', 'Отмена'],
                '006' => ['Delete selected items', 'Таңдап алынғандарды жою', 'Удалить выбранные'],
                '007' => ['Are you sure you want to delete?', 'Жоюды растау', 'Подтвердить удаление'],
                '008' => ['Choose', 'таңдаңыз', 'Выберите'],
                '009' => ['Add', 'Қосу қажет', 'Необходимо добавить'],
                '010' => ['english', 'қазақ', 'Синхронизировать критерии'],
                '020' => ['Yes', 'ИӘ', 'ДА'],
                '021' => ['NO', 'ЖОҚ', 'НЕТ'],
                '022' => ['Not given', 'Көрсетілмеген', 'Не указано'],
                '030' => ['All', 'Барлығы', 'Все поля'],
                '031' => ['english', 'қазақ', 'ВСЕГО'],
                '050' => ['Downoad', 'қазақ', 'Скачать'],
                '100' => ['Name', 'Атауы', 'Наименование'],
                '150' => ['Activities', 'Әрекеттер', 'Действия'],
                '160' => ['Data is not given', 'Деректер жоқ', 'Данные отсутствуют'],
                '161' => ['Search is activated', 'Іздеу жүргізілуде', 'Задействован поиск']
            ],
            'g-error' => [ // общие ошибки: 001-899
                '001' => ['Unknown error', 'Белгісіз қате', 'Неизвестная ошибка'],
                '002' => ['Error', 'Қатеқ', 'Ошибка'],
                '100' => ['Server is not found', 'Сервер қолжетімсіз', 'Сервер недоступен'],
                '101' => ['The response is not a valid JSON response', 'JSON форматына сай келмейтін жауап', 'Ответ не в формате JSON'],
                '102' => ['Failed to receive data', 'Деректерді алу жүзеге асырылмады', 'Получить данные не удалось'],
                '200' => ['Parameters are invalid', 'Қате параметрлер', 'Некорректные параметры'],
                '201' => ['Please, fill in the mandatory fields', 'Толтырылуы тиіс жолдарды толтыру', 'Необходимо заполнить обязательные поля'],
                '300' => ['Database error', 'Деректер базасындағы қате', 'Ошибка базы данных'],
                '301' => ['Data is used', 'Деректер қолданылуда', 'Данные используются'],
                '800' => ['Close message', 'Хабарламаны жабу', 'Закрыть сообщение']
            ],
             'c-menu-top' => [ // компонента - верхнее меню
                '001' => ['Logout', 'Шығу', 'Выйти']
            ],
            'c-menu-left' => [ // компонента - боковое (левое) меню
                '001' => ['Assessment', 'Бағалау', 'Оценивание'],
                '100' => ['References', 'Анықтамалықтар', 'Справочники'],
                '110' => ['Study', 'Оқу', 'Образование'],
                '111' => ['Levels', 'Деңгейлер', 'Уровни'],
                '112' => ['Areas', 'Салалар', 'Области'],
                '113' => ['Grades', 'Сыныптар', 'Классы'],
                '120' => ['Subjects', 'Пәндер', 'Дисциплины'],
                '121' => ['Units', 'Бөлім', 'Разделы'],
                '122' => ['Topics', 'Бөлімше', 'Подразделы'],
                '123' => ['Learning objectives', 'Оқу мақсаттары', 'Цели обучения'],
                '130' => ['Criteria', 'Критерийлер', 'Критерии'],
                '131' => ['Selected criteria', 'Таңдап алынған критерийлер', 'Наборы'], 
                '132' => ['L1 Criteria', '1Д критерийлері', 'Критерии У1'],
                '133' => ['L2 Criteria', '2Д критерийлері', 'Критерии У2'],
                '134' => ['L3 Criteria', '3Д критерийлері', 'Критерии У3'],
                '135' => ['Rates', 'Бағалар', 'Оценки'],
                '140' => ['Diagrams', 'Графиктер', 'Графики'],
                '200' => ['Users', 'Пайдаланушылар', 'Пользователи']
            ],
            'c-footer-private' => [ // компонента - боковое (левое) меню
                '001' => ['Are you sure you want to log out?', 'Шығуды растау', 'Подтвердите выход'],
                '002' => ['Logout', 'Шығу', 'Выйти'],
                '003' => ['Cancel', 'Болдырмау', 'Отмена']
            ],
            'p-404' => [ // страница - 404
                '001' => ['Page is not found', 'Сіз іздеген бет табылған жоқ', 'Страница не найдена'],
                '002' => ['Back to Main Page', 'Басты бетке', 'На главную']
            ],
            'p-900' => [ // страница - база данных недоступна
                '001' => ['Database is not available', 'Деректер базасы қолжетімсіз', 'База данных недоступна'],
                '002' => ['Go to Main Page', 'Басты бетке', 'На главную']                
            ],
            'p-login' => [ // страница - авторизации
                '001' => ['Authorization', 'Авторизация', 'Авторизация'],
                '002' => ['E-mail address', 'Электрондық пошта мекенжайы', 'Адрес электронной почты'],
                '003' => ['Password', 'Құпиясөз', 'Пароль'],
                '004' => ['Remember me', 'есте сақтау', 'запомнить меня'],
                '005' => ['Login', 'Кіру', 'Войти'],
                '006' => ['New password', 'Жаңа құпиясөз', 'Новый пароль'],
                '900' => ['Data is incorrect', 'Деректер дұрыс енгізілген жоқ', 'Данные указаны некорректно'],
                '901' => ['The user does not exist', 'Пайдаланушы табылған жоқ', 'Пользователь не существует'],
                '902' => ['Access is blocked', 'Кіру рұқсаты бұғатталды', 'Доступ заблокирован'],
                '903' => ['Create a new password', 'Жаңа құпиясөз орнату қажет', 'Необходимо создать новый пароль'],
                '904' => ['Password is incorrect', 'Құпиясөз дұрыс емес', 'Неверный пароль']
            ],
            'p-forgot' => [ // страница - востановления пароля
                '001' => ['New password', 'Жаңа құпиясөз', 'Новый пароль'],
                '002' => ['Further instructions will be sent to the given email address', 'Көрсетілген электрондық пошта мекенжайына нұсқаулығы бар хат жіберіледі', 'На указаный адрес электронной почты будет выслано письмо с инструкцией'],
                '003' => ['E-mail address', 'Электрондық пошта мекенжайы', 'Адрес электронной почты'],
                '004' => ['Request an email', 'Хат сұрату', 'Запросить письмо'],
                '005' => ['Authorization', 'Авторизация', 'Авторизация'],
                '900' => ['Enter your email address', 'Электрондық пошта мекенжайын көрсету қажет', 'Необходимо указать адрес электронной почты'],
                '901' => ['The user does not exist', 'Пайдаланушы табылған жоқ', 'Пользователь не существует'],
                '902' => ['Access is blocked', 'Кіру рұқсаты бұғатталды', 'Доступ заблокирован'],
                '903' => ['Email address is invalid', 'Электрондық пошта мекенжайы дұрыс емес', 'Некорректный адрес электронной почты'],
                '904' => ['TETTA: New password', 'ТЕТТА: Жаңа құпиясөз', 'ТЕТТА: Новый пароль'],
                '905' => ['Please, follow the link to set up a new password', 'Жаңа құпиясөзді орнату үшін келесі сілтемемен өтіңіз', 'Для создания нового пароль перейдите по данной ссылке'],
                '906' => ['Instructions have been sent to your email address', 'Нұсқаулығы бар хат жіберілді', 'Письмо с инструкцией отправлено'],
                '907' => ['Failed to send email', 'Хат жіберілмеді', 'Не удалось отправить письмо']
            ],
            'p-password' => [ // страница - установки нового пароля
                '001' => ['Create a password', 'Құпиясөз орнату', 'Создание пароля'],
                '002' => ['Create a new password', 'Сіздің тіркеулік жазбаңыз үшін жаңа құпиясөз орнатыңыз', 'Задайте новый пароль для Вашей учётной записи'],
                '003' => ['Password can contain any characters', 'Құпиясөз кез-келген белгілерден тұра алады', 'Пароль может содержать любые символы'],
                '004' => ['Password must be 8-20 characters', 'Құпиясөз 8-ден 20-ға дейін қоса алғанда белгілерден тұра алады', 'Длина пароля от 8 до 20 символов включительно'],
                '005' => ['New password', 'жаңа құпиясөз', 'Новый пароль'],
                '006' => ['Create', 'Орнату', 'Создать'],
                '007' => ['Authorization', 'Авторизация', 'Авторизация'],
                '900' => ['Password length is not valid', 'Құпиясөздің ұзындығы дұрыс емес', 'Некорректная длина пароля'],
                '901' => ['You successfully created a new password', 'Жаңа құпиясөз сәтті орнатылды', 'Новый пароль успешно создан']
            ],
            'c-users' => [ // компонента - пользователи
                '001' => ['Users', 'Пайдаланушылар', 'Пользователи'],
                '002' => ['User name', 'Пайдаланушының аты-жөні', 'Имя пользователя'],
                '003' => ['Account', 'Есептік деректер', 'Учётные данные'],
                '004' => ['Role', 'Рөл', 'Роль'],
                '005' => ['Choose role', 'Рөлді таңдаңыз', 'Выберите роль'],
                '006' => ['Email', 'Email', 'Email'],
                '007' => ['Password', 'Құпиясөз', 'Пароль'],
                '008' => ['Access', 'Рұқсат', 'Доступ'],
                '900' => ['This email address already exists', 'Көрсетілген e-mail пайдаланушысын қайта енгізу мүмкін емес', 'Пользователь с указаным e-mail уже существует']
            ],
            'c-education-level' => [ // компонента - уровни образования
                '001' => ['Levels', 'Білім деңгейлері', 'Уровни образования'],
                '900' => ['This level already exists', 'Бұл білім деңгейін қайта таңдау мүмкін емес', 'Уровень образования уже существует']
            ],
            'c-education-field' => [ // компонента - области образования
                '001' => ['Areas of Education', 'Білім беру салалары', 'Образовательные области'],
                '002' => ['Levels', 'Білім деңгейлері', 'Уровни образования'],
                '900' => ['This area already exists', 'БҰл білім саласын қайта таңдау мүмкін емес', 'Область образования уже существует']
            ],
            'c-education-class' => [ // компонента - классы
                '001' => ['Grades', 'Сыныптар', 'Классы'],
                '002' => ['Levels', 'Білім деңгейлері', 'Уровни образования'],
                '900' => ['This grade already exists', 'Бұл сыныпты қайта таңдау мүмкін емес', 'Класс уже существует']
            ],
            'c-discipline-item' => [ // компонента - дисциплины
                '001' => ['Subjects', 'Пәндерқ', 'Дисциплины'],
                '002' => ['Area of Education', 'Білім саласы', 'Область образования'],
                '003' => ['Grades', 'Сыныптар', 'Классы'],
                '100' => ['Grade', 'Сынып', 'Класс'],
                '900' => ['This subject already exists', 'Бұл пәнді қайта таңдау мүмкін емес', 'Дисциплина уже существует']
            ],
            'c-discipline-section' => [ // компонента - разделы
                '001' => ['Units', 'Бөлім', 'Разделы'],
                '002' => ['Subject', 'Пән', 'Дисциплинa'],
                '003' => ['Choose subject', 'Пәнді таңдау', 'Выберите дисциплину'],
                '100' => ['Subject', 'Пән', 'Дисциплину'],
                '900' => ['This unit already exists', 'Таңдап алынған пәнге қатысты тарауды қайта таңдау мүмкін емес', 'Раздел уже существует для выбранной дисциплины']
            ],
            'c-discipline-subsection' => [ // компонента - подразделы
                '001' => ['Topics', 'Бөлімше', 'Подразделы'],
                '002' => ['Unit', 'Бөлім', 'Раздел'],
                '003' => ['Subject', 'Пән', 'Дисциплина'],
                '004' => ['Choose subject', 'Пәнді таңдаңыз', 'Выберите дисциплину'],
                '100' => ['Subject', 'Пән', 'Дисциплину'],
                '900' => ['This topic for selected subject and unit already exists', 'Таңдап алынған пән мен тарауға қатысты бөлімше қайта таңдау мүмкін емес', 'Подраздел уже существует для выбранной дисциплины и раздела']
            ],
            'c-discipline-target' => [ // компонента - цели
                '001' => ['Learning objectives', 'Оқу мақсаттары', 'Цели обучения'],
                '002' => ['Topic', 'Бөлімше', 'Подраздел'],
                '003' => ['Subject', 'Пән', 'Дисциплина'],
                '004' => ['Grade', 'Сынып', 'Класс'],
                '050' => ['Choose subject', 'Пәнді таңдаңыз', 'Выберите дисциплину'],
                '051' => ['Choose grade', 'Сыныпты таңдаңыз', 'Выберите класс'],
                '100' => ['Subject', 'Пән', 'Дисциплину'],
                '900' => ['This learning objective for selected subject and topic already exists', 'Таңдап алынған пән мен бөлімше қатысты мақсатты қайта таңдау мүмкін емес', 'Цель уже существует для выбранной дисциплины и подраздела']
            ],
            'c-criteria-level-1' => [ // компонента - критерии 1 уровня
                '001' => ['Level 1 Criteria', '1 деңгей критерийлері', 'Критерии 1 уровня'],
                '900' => ['Level 1 Criteria already exist', '1Д критерийлерін таңдау мүмкін емес', 'Критерии У1 уже существует']
            ],
            'c-criteria-level-2' => [ // компонента - критерии 2 уровня
                '001' => ['Level 2 Criteria', '2 деңгей критерийлері', 'Критерии 2 уровня'],
                '002' => ['L1 Criteria', '1Д критерийлері', 'Критерии У1'],
                '100' => ['L1 Criteria', '1Д критерийлері', 'Критерий 1-го уровня'],
                '900' => ['L2 Criteria already exist', '1Д критерийлері үшін 2Д критерийлерін таңдау мүмкін емес', 'Критерии У2 для критерия У1 уже существует']
            ],
            'c-criteria-level-3' => [ // компонента - критерии 3 уровня
                '001' => ['Level 3 Criteria', '3 деңгей критерийлері', 'Критерии 3 уровня'],
                '002' => ['L2 Criteria', '2Д критерийлері', 'Критерии У2'],
                '100' => ['Level 2 Criteria', '2Д критерийлері', 'Критерий 2-го уровня'],
                '900' => ['Level 3 Criteria for Level 2 criteria already exist', '2Д критерийлері үшін 3Д критерийлерін таңдау мүмкін емес', 'Критерии У3 для критерия У2 уже существует']
            ],
            'c-criteria-val' => [ // компонента - оценки
                '001' => ['Grades', 'Бағалар', 'Оценки'],
                '002' => ['Grade', 'Баға', 'Оценкa'],
                '003' => ['Description', 'Сипаттамасы', 'Описание'],
                '004' => ['~~~EN~~~', '~~~KZ~~~', 'Цвет'],
                '900' => ['This grade already exists', 'Бұл бағаны таңдау мүмкін емес', 'Оценка уже существует']
            ],
            'c-dict-rate-item' => [ // компонента - оценивание
                '001' => ['Assessment', 'Бағалау', 'Оценивание'],
                '002' => ['Subject', 'Пән', 'Дисциплина'],
                '003' => ['Grade', 'Сынып', 'Класс'],
                '004' => ['Expert', 'Сарапшы', 'Эксперт'],
                '005' => ['Comment', 'Пікір', 'Комментарий'],
                '006' => ['Status', 'Кезең', 'Статус'],
                '050' => ['Choose expert', 'Сарапшыны таңдаңыз', 'Выберите эксперта'],
                '051' => ['Add comment', 'Пікір қалдыру', 'Добавить комментарий'],
                '100' => ['Expert', 'Сарапшы', 'Эксперта'],
                '900' => ['This learning objective already exists', 'Бұл бағалау нұсқасын қайта таңдау мүмкін емес', 'Данный вариант оценивания уже существует']
            ],
            'c-dict-rate-val' => [ // компонента - оценки
                '001' => ['Assessment', 'Бағалау', 'Оценивание'],
                '002' => ['Grade', 'Сынып', 'Класс'],
                '003' => ['L1', '1Д', 'У1'],
                '004' => ['L2', '2Д', 'У2'],
                '005' => ['L3', '3Д', 'У3'],
                '006' => ['Objectives', 'Мақсаттар', 'Цели'],
                '007' => ['Unit', 'Бөлім', 'Раздел'],
                '008' => ['Topic', 'Бөлімше', 'Подраздел'],
                '009' => ['Grade', 'Баға', 'Оценка'],
                '900' => ['@@@', '@@@', '@@@']
            ],
            'c-view-target' => [ // компонента - просмотр значения оценок
                '001' => ['english', 'қазақ', 'Цель'],
                '002' => ['english', 'қазақ', 'Уровень'],
                '003' => ['english', 'қазақ', 'Область'],
                '004' => ['Grade', 'Сынып', 'Класс'], 
                '005' => ['Subject', 'Пән', 'Дисциплина'],
                '006' => ['Unit', 'Бөлім', 'Раздел'],
                '007' => ['Topic', 'Бөлімше', 'Подраздел'],
                '008' => ['english', 'қазақ', 'Критерий У1'],
                '009' => ['english', 'қазақ', 'Критерий У2'],
                '010' => ['english', 'қазақ', 'Критерий У3'],
                '011' => ['Grade', 'Баға', 'Оценка'],
                '012' => ['english', 'қазақ', 'Описание значения оценок'],
                '013' => ['english', 'қазақ', 'Отсутствует оценка для цели'],
                '100' => ['english', 'қазақ', 'Уровень образования'],
                '101' => ['english', 'қазақ', 'Область образования'],
                '102' => ['english', 'қазақ', 'Дисциплину'],
                '200' => ['english', 'қазақ', 'Цели']
            ],
            'c-view-val' => [ // компонента - просмотр соотношения оценок по уровням
                '001' => ['english', 'қазақ', 'Оценки'],
                '002' => ['english', 'қазақ', 'Уровень'],
                '003' => ['english', 'қазақ', 'Область'],
                '004' => ['Grade', 'Сынып', 'Класс'], 
                '005' => ['Subject', 'Пән', 'Дисциплина'],
                '006' => ['Unit', 'Бөлім', 'Раздел'],
                '007' => ['Topic', 'Бөлімше', 'Подраздел'],
                '008' => ['L1', '1Д', 'Критерий У1'],
                '009' => ['L2', '2Д', 'Критерий У2'],
                '010' => ['L3', '3Д', 'Критерий У3'],
                '011' => ['Grade', 'Баға', 'Оценка'],
                '012' => ['english', 'қазақ', 'Описание значения оценки'],
                '013' => ['english', 'қазақ', 'Отсутствует оценка для целей'],
                '014' => ['english', 'қазақ', 'Цель'],
                '100' => ['english', 'қазақ', 'Уровень образования'],
                '101' => ['english', 'қазақ', 'Область образования'],
                '102' => ['english', 'қазақ', 'Дисциплину'],
                '200' => ['english', 'қазақ', 'Проценты']
            ],
            'c-view-criteria' => [ // компонента - просмотр соотношения оценок по критериям
                '001' => ['english', 'қазақ', 'Оценки'],
                '002' => ['english', 'қазақ', 'Уровень'],
                '003' => ['english', 'қазақ', 'Область'],
                '004' => ['Grade', 'Сынып', 'Класс'], 
                '005' => ['Subject', 'Пән', 'Дисциплина'],
                '006' => ['Unit', 'Бөлім', 'Раздел'],
                '007' => ['Topic', 'Бөлімше', 'Подраздел'],
                '008' => ['L1', '1Д', 'У1'],
                '009' => ['L2', '2Д', 'У2'],
                '010' => ['L3', '3Д', 'У3'],
                '011' => ['Grade', 'Баға', 'Оценка'],
                '012' => ['english', 'қазақ', 'Описание значения оценки'],
                '013' => ['english', 'қазақ', 'Отсутствует оценка для целей'],
                '014' => ['english', 'қазақ', 'Цель'],
                '100' => ['english', 'қазақ', 'Уровень образования'],
                '101' => ['english', 'қазақ', 'Область образования'],
                '102' => ['english', 'қазақ', 'Дисциплину'],
                '200' => ['english', 'қазақ', 'Критерии']
            ],
            'c-view-total' => [ // компонента - просмотр количества оценок
                '001' => ['english', 'қазақ', 'Оценки'],
                '002' => ['english', 'қазақ', 'Уровень'],
                '003' => ['english', 'қазақ', 'Область'],
                '004' => ['Grade', 'Сынып', 'Класс'], 
                '005' => ['Subject', 'Пән', 'Дисциплина'],
                '006' => ['Unit', 'Бөлім', 'Раздел'],
                '007' => ['Topic', 'Бөлімше', 'Подраздел'],
                '008' => ['L1', '1Д', 'У1'],
                '009' => ['L2', '2Д', 'У2'],
                '010' => ['L3', '3Д', 'У3'],
                '013' => ['english', 'қазақ', 'Отсутствует оценка для целей'],
                '100' => ['english', 'қазақ', 'Уровень образования'],
                '101' => ['english', 'қазақ', 'Область образования'],
                '102' => ['english', 'қазақ', 'Дисциплину'],
                '200' => ['english', 'қазақ', 'Количество целей']
            ],
            'excel' => [ // excel
                '001' => ['english', 'Бөлім', 'Раздел'],
                '002' => ['english', 'қазақ', 'Подраздел'],
                '003' => ['english', 'қазақ', 'Цели обучения'],
                '004' => ['english', 'қазақ', 'Для дисциплины не заданы цели'],
                '005' => ['english', 'қазақ', 'Описание значения оценки'],
                '006' => ['english', 'қазақ', 'Процент оценок'],
                '007' => ['english', 'қазақ', 'Отсутствует оценка для целей'],
                '008' => ['english', 'қазақ', 'Количество целей для оценок'],
                '010' => ['english', 'қазақ', 'Уровень'],
                '011' => ['english', 'қазақ', 'Область'],
                '012' => ['Grade', 'Сынып', 'Класс'], 
                '013' => ['Subject', 'Пән', 'Дисциплина'],
                '014' => ['Unit', 'Бөлім', 'Раздел'],
                '015' => ['Topic', 'Бөлімше', 'Подраздел'],
                '016' => ['english', 'қазақ', 'Цель'],
                '017' => ['L1', '1Д', 'Критерий У1'],
                '018' => ['L2', '2Д', 'Критерий У2'],
                '019' => ['L3', '3Д', 'Критерий У3'],
                '100' => ['english', 'қазақ', 'Проценты'],
                '101' => ['english', 'қазақ', 'Критерии'],
                '102' => ['english', 'қазақ', 'Количество целей']
            ]
        ];

    //  проверка параметра локализации
        if (!isset($_COOKIE['LANG']) || !in_array($_COOKIE['LANG'], [0, 1, 2])) {
            $_COOKIE['LANG'] = $GLOBALS['@']['LANG']['DEFAULT'];
        }
        setcookie('LANG', $_COOKIE['LANG'], time() + 315360000, '/');

    //  определение текущего набора локализации
        foreach ($GLOBALS['@']['LANG']['DATA'] as $e => $elem) {
            foreach ($elem as $i => $arr) {
                $GLOBALS['@']['LANG']['DATA'][$e][$i] = $arr[$_COOKIE['LANG']];
            }
        }